{u'poster_path': u'/d5v34mY5G4TYQnDHfPC5r7TAWPq.jpg', u'title': u'Crown for Christmas', u'overview': u'After getting fired from her job as a maid at a ritzy New York City hotel, Allie reluctantly accepts a temp gig as the governess to a young girl who is part of a powerful family in Europe that lives in an actual castle. After arriving, Allie learns the girl is named Princess Theodora and her father is Maximillion, the King of Winshire. The King informs Allie that the Princess has a tendency to terrorize authority figures, a predilection that has grown worse since her mother’s death. Yet governess and Princess wind up hitting it off while at the same time a spark forms between Allie and Max. However, Countess Celia is expecting to wed the King. Will Max take a stand for his feelings for Allie and make it truly a merry Christmas for all (or at least, most)?', u'release_date': u'2015-11-27', u'popularity': 2.92337, u'original_title': u'Crown for Christmas', 'directors': [], u'backdrop_path': None, 'producers': [{'name': u'Alex Zamm', 'id': 88077}], u'vote_count': 0, u'video': False, u'adult': False, u'vote_average': 0.0, 'casting': [{u'name': u'Danica McKellar', u'character': u'Allie', u'id': 65220, u'credit_id': u'55fe0a3bc3a3681337001ead', u'cast_id': 0, u'profile_path': u'/z9osq8skBdRpAPAQ0nggTxyEbtH.jpg', u'order': 1}, {u'name': u'Rupert Penry-Jones', u'character': u'', u'id': 42276, u'credit_id': u'55fe0a4ac3a36813340020a9', u'cast_id': 1, u'profile_path': u'/8WoMM6UnqbZuSV46uCDBqJK3Hd7.jpg', u'order': 2}, {u'name': u'Ellie Botterill', u'character': u'', u'id': 1529913, u'credit_id': u'563515c09251416d5200a3b3', u'cast_id': 5, u'profile_path': None, u'order': 3}, {u'name': u'Pavel Douglas', u'character': u'', u'id': 1228249, u'credit_id': u'563515cd9251414ab70164f9', u'cast_id': 6, u'profile_path': None, u'order': 4}, {u'name': u'Colin McFarlane', u'character': u'', u'id': 128386, u'credit_id': u'563515d79251414ab70164fb', u'cast_id': 7, u'profile_path': u'/iUQFSfX8H17g2xumh6G7WLvtXOJ.jpg', u'order': 5}], u'genre_ids': [10770], 'similar': [], u'id': 360603, u'original_language': u'en'}